app/views/projects/show.html.erb

SELECT "phases".* FROM "phases" WHERE "phases"."project_id" = 1 AND "phases"."type" = 'Onboarding' LIMIT 1
---
  <ul>Phases:
    <% @project.phases.each do |phase| %>

SELECT "posts".* FROM "posts" WHERE "posts"."phase_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
---
<p>
  <% @current_phase.posts.each do |post| %>
    <h5><%= post.title %></h5>
    <span><%= User.find(post.user_id).first_name unless post.user_id == nil %></span>