app/views/projects/pages/_phase.html.erb

      <%= image_tag post.user.avatar_url, :class => "media-object img-rounded pagination-centered", :width => "60" %>
      <p class="pagination-centered"><%= post.user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1

      <!-- sub posts -->
      <% post.subposts.each do |subpost| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."phase_id" = 1