app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("attachment_content_type", "attachment_file_name", "attachment_file_size", "attachment_updated_at", "comment", "created_at", "message", "phase_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)