app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
        project = Project.last
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT 1