app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "phases".* FROM "phases" WHERE "phases"."project_id" = 1 AND "phases"."type" = 'Onboarding' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."phase_id" = 1
---
  def show
    @back = request.env['HTTP_REFERER']

    @phase = params[:phase]
    @upload = "as"

    @project = Project.find(params[:id])
    @phases = ['onboarding','creative','design','development','implementation']

    @page = params[:page]
    @page = 'phase' unless @page.present?

    if params[:phase].present?
      @phase = params[:phase]
    elsif params[:current_phase].present?
      @phase = params[:current_phase]
    else
      @phase = @project.current_phase
    end


    @posts = Post.where(:project_id => @project.id)

    if @page != 'overview'
      @posts = @posts.where(:phase => @phase).sort! { |a,b| b.updated_at <=> a.updated_at }

INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 15 Nov 2012 00:54:18 UTC +00:00], ["name", "Perfect Search Design"], ["updated_at", Thu, 15 Nov 2012 00:54:18 UTC +00:00]]
---
  def create
    @project = Project.new
    @project.name = params[:name]

    respond_to do |format|
      if @project.save